from pymongo import MongoClient  # pymongo를 임포트 하기
client = MongoClient('localhost', 27017)  # mongoDB는 27017 포트로 돌아갑니다.
db = client.myproject




birds = ["가마우지", "가창오리", "갈까마귀", "갈매기", "갈색양진이", "갈색얼가니새", "갈색제비", "개개비", "개개비사촌", "개구리매", "개꿩", "개똥지빠귀", "개리", "개미잡이",
         "검독수리", "검둥오리", "검둥오리사촌", "검은가슴물떼새", "검은다리솔새(가칭)", "검은댕기해오라기", "검은등뻐꾸기", "검은등사막딱새", "검은등제비갈매기", "검은등할미새",
         "검은딱새", "검은머리갈매기", "검은머리딱새", "검은머리멧새(가칭)", "검은머리물떼새", "검은머리방울새", "검은머리쑥새", "검은머리촉새", "검은머리흰따오기", "검은머리흰죽지",
         "검은멧새", "검은목논병아리", "검은목두루미", "검은목지빠귀", "검은바람까마귀", "검은뺨딱새", "검은이마직박구리(가칭)", "검은지빠귀", "검은할미새사촌", "검은해오라기",
         "검은흰죽지(가칭)", "고니", "고대갈매기[적호갈매기]", "고방오리", "고산대머리수리(가칭)", "곤줄박이", "관수리", "괭이갈매기", "구레나룻제비갈매기", "군함조", "굴뚝새",
         "귀뿔논병아리", "귀제비", "금눈쇠올빼미", "긴꼬리때까치", "긴꼬리올빼미", "긴꼬리홍양진이", "긴다리사막딱새(가칭)", "긴다리솔새사촌", "긴발톱멧새", "긴발톱할미새", "긴부리도요",
         "긴점박이올빼미", "까마귀", "까막딱다구리", "까치", "깝작도요", "꺅도요", "꺅도요사촌", "꼬까도요", "꼬까직박구리", "꼬까참새", "꼬리치레", "꼬마도요", "꼬마물떼새",
         "꾀꼬리", "꿩", "나무발발이", "넓적부리", "넓적부리도요", "노랑눈썹멧새", "노랑눈썹솔새", "노랑딱새", "노랑때까치", "노랑머리할미새", "노랑발갈매기", "노랑발도요",
         "노랑배진박새(가칭)", "노랑부리백로", "노랑부리저어새", "노랑턱멧새", "노랑할미새", "노랑허리솔새", "녹색비둘기", "논병아리", "누른도요", "느시", "대륙검은지빠귀",
         "댕기물떼새", "댕기흰죽지", "덤불해오라기", "독수리", "동고비", "동박새", "되새", "되솔새", "되지빠귀", "두견이", "두루미", "뒷부리도요", "뒷부리장다리물떼새", "들꿩",
         "따오기", "딱새", "때까치", "떼까마귀", "뜸부기", "마도요", "말똥가리", "매", "매사촌", "먹황새", "멋쟁이[멋쟁이새]", "메추라기", "메추라기도요", "멧닭",
         "멧도요", "멧비둘기", "멧새", "멧종다리", "목도리도요", "목점박이비둘기(가칭)", "목테갈매기", "무당새", "물까마귀", "물까치", "물꿩", "물닭", "물때까치", "물레새",
         "물수리", "물총새", "미국오리", "미국흰죽지", "민댕기물떼새", "민물가마우지", "민물도요", "밀화부리", "바바늘꼬리도요", "바늘꼬리칼새", "바다꿩", "바다비오리",
         "바다쇠오리", "바다오리", "바다제비", "바다직박구리", "바람까마귀", "바위종다리", "박새", "발구지", "밤색날개뻐꾸기", "방울새", "밭종다리", "백할미새", "버들솔새",
         "벌매", "벙어리뻐꾸기", "별삼광조", "부채꼬리바위딱새(가칭)", "북극도둑갈매기", "북극흰갈매기", "북방개개비", "북방검은머리쑥새", "북방쇠박새", "북방쇠종다리", "북방쇠찌르레기",
         "북방흰뺨오리", "분홍가슴비둘기", "붉은가슴도요", "붉은가슴밭종다리", "붉은가슴울새", "붉은가슴흰죽지", "붉은갯도요", "붉은머리멧새", "붉은머리오목눈이", "붉은발도요",
         "붉은발슴새", "붉은배새매", "붉은배오색딱다구리", "붉은배제비(가칭)", "붉은배지느러미발도요", "붉은배지빠귀", "붉은부리갈매기", "붉은부리까마귀", "붉은부리찌르레기(가칭)",
         "붉은부리흰죽지", "붉은뺨가마우지", "붉은뺨멧새", "붉은어깨도요", "붉은왜가리", "붉은해오라기", "붉은허리개개비", "비둘기조롱이", "비오리", "뻐꾸기", "뿔논병아리", "뿔매",
         "뿔쇠오리", "뿔종다리", "뿔호반새", "삑삑도요", "사다새", "사막꿩", "산솔새", "삼광조", "상모솔새", "새매", "새홀리기", "섬개개비", "섬참새", "세가락갈매기",
         "세가락도요", "세가락딱다구리", "세가락메추라기", "소쩍새", "솔개", "솔딱새", "솔부엉이", "솔새사촌", "솔양진이", "솔잣새", "송곳부리도요", "쇠가마우지", "쇠개개비",
         "쇠검은머리쑥새", "쇠기러기", "쇠동고비", "쇠딱다구리", "쇠뜸부기", "쇠뜸부기사촌", "쇠목테갈매기", "쇠물닭", "쇠박새", "쇠밭종다리", "쇠백로", "쇠부리도요", "쇠부리슴새",
         "쇠부엉이", "쇠붉은뺨멧새", "쇠솔딱새", "쇠솔새", "쇠오리", "쇠오색딱다구리", "쇠유리새", "쇠재두루미", "쇠제비갈매기", "쇠종다리", "쇠찌르레기", "쇠청다리도요", "쇠칼새",
         "쇠홍방울새", "쇠황조롱이", "쇠흰턱딱새", "수리갈매기", "수리부엉이", "수염수리", "수염오목눈이", "숲새", "스윈호오목눈이", "슴새", "시베리아흰두루미", "쏙독새", "쑥새",
         "아메리카메추라기도요", "아메리카홍머리오리", "아물쇠딱다구리", "아비", "알락개구리매", "알락꼬리마도요", "알락꼬리쥐발귀", "알락도요", "알락뜸부기", "알락쇠오리", "알락오리",
         "알락할미새", "알락해오라기", "알바트로스", "양비둘기", "양진이", "어치", "연노랑솔새(가칭)", "열대붉은해오라기", "염주비둘기", "오목눈이", "오색딱다구리", "올빼미",
         "왕눈물떼새", "왕새매", "왜가리", "울새", "울음고니(가칭)", "원앙", "원앙사촌", "유리딱새", "작은도요", "작은바다오리", "작은흰갈매기", "잣까마귀", "장다리물떼새",
         "재갈매기", "재두루미", "잿빛개구리매", "잿빛쇠찌르레기", "저어새", "적원자", "점무늬가슴쥐발귀", "점박이멧새", "제비", "제비갈매기", "제비딱새", "제비물떼새", "조롱이",
         "좀도요", "종다리", "종달도요", "줄무늬노랑발갈매기", "중대백로", "중백로", "중부리도요", "쥐발귀개개비", "지느러미발도요", "직박구리", "진박새", "진홍가슴", "찌르레기",
         "참매", "참새", "참수리", "청다리도요", "청다리도요사촌[쇠청다리도요사촌]", "청도요", "청둥오리", "청딱다구리", "청머리오리", "청호반새", "초원수리", "촉새",
         "칡때까치", "칡부엉이", "칼새", "캐나다기러기", "캐나다두루미", "콩새", "크낙새", "큰개개비", "큰검은머리갈매기(가칭)", "큰고니", "큰기러기", "큰꺅도요",
         "큰노랑발도요", "큰논병아리", "큰덤불해오라기", "큰뒷부리도요", "큰말똥가리", "큰물떼새", "큰밭종다리", "큰부리개개비", "큰부리까마귀", "큰부리도요", "큰부리밀화부리",
         "큰부리제비갈매기", "큰소쩍새", "큰오색딱다구리", "큰왕눈물떼새", "큰유리새", "큰재갈매기", "큰재개구마리", "큰제비갈매기", "큰지느러미발도요", "큰회색머리아비", "큰흰죽지",
         "털발말똥가리", "파랑새", "팔색조", "푸른얼굴얼가니새", "학도요", "한국동박새", "한국뜸부기", "한국밭종다리", "할미새사촌", "항라머리검독수리", "해오라기", "헨다손매",
         "호랑지빠귀", "호반새", "호사도요", "호사비오리", "혹고니", "혹부리오리", "홍머리오리", "홍방울새", "홍비둘기", "홍여새", "황금새", "황로", "황새", "황여새",
         "황오리", "황조롱이", "회색기러기", "회색머리아비", "회색바람까마귀", "후투티", "휘파람새", "흑기러기", "흑꼬리도요", "흑두루미", "흑로", "흑비둘기", "흰가슴숲제비",
         "흰갈매기", "흰기러기", "흰꼬리딱새", "흰꼬리수리", "흰꼬리좀도요", "흰날개해오라기", "흰눈썹뜸부기", "흰눈썹물떼새(가칭)", "흰눈썹바다오리", "흰눈썹붉은배지빠귀", "흰눈썹울새",
         "흰눈썹지빠귀", "흰눈썹황금새", "흰등밭종다리", "흰머리기러기", "흰머리딱새", "흰머리멧새", "흰멧새", "흰목물떼새", "흰물떼새", "흰배뜸부기", "흰배멧새", "흰배슴새",
         "흰배지빠귀", "흰부리아비", "흰비오리", "흰뺨검둥오리", "흰뺨오리", "흰수염바다오리", "흰수염작은바다오리", "흰올빼미", "흰이마기러기", "흰점찌르레기", "흰죽지",
         "흰죽지갈매기", "흰죽지꼬마물떼새", "흰죽지솔잣새", "흰죽지수리", "흰줄박이오리", "흰털발제비", "힝둥새"]

for bird in birds:
    db.birds.insert_one({'name': bird})
